Documents/ОперацияБух.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ОперацияБух</Name>
			<Comment>(Регл)</Comment>
			<BasedOn>
				<xr:Item>Catalog.ТиповыеОперации</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.фин_ФактическиеОборотыБюджетов</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыОрганизацийБУ</xr:Item>
				<xr:Item>AccumulationRegister.фин_ОборотыБюджетов</xr:Item>
				<xr:Item>AccountingRegister.Налоговый</xr:Item>
				<xr:Item>AccumulationRegister.фин_КонтролируемыеФинансовыеПоказатели</xr:Item>
				<xr:Item>AccountingRegister.Типовой</xr:Item>
				<xr:Item>AccumulationRegister.Удалить_фин_ОстаткиБюджетов</xr:Item>
				<xr:Item>AccountingRegister.фин_Бюджетирование</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОперации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТиповаяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТиповыеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗапрашиваемыеПараметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccountingRegisters/Типовой.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccountingRegister>
		<Properties>
			<Name>Типовой</Name>
			<Comment>(Регл)</Comment>
			<ChartOfAccounts>ChartOfAccounts.Типовой</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Типовой.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтруктурноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсточникФинансирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансирования</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Типовой.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Типовой.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Типовой.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Типовой.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Типовой.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЖурнала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРегламентнойОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРегламентныхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

AccountingRegisters/Налоговый.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccountingRegister>
		<Properties>
			<Name>Налоговый</Name>
			<Comment>(Регл)</Comment>
			<ChartOfAccounts>ChartOfAccounts.Налоговый</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыУчетаНУ</v8:Type>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтруктурноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсточникФинансирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансирования</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Налоговый.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Налоговый.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Налоговый.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НомерЖурнала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРегламентнойОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРегламентныхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Documents/ОперацияБух/Ext/ObjectModule.bsl
Перем мВалютаРегламентированногоУчета;
Перем мКэшСоответствиеСчетов Экспорт;

Перем мОтображатьСтруктурныеПодразделения Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

// Производит замену предопределенных конструкций в формульном выражении
// К формульным конструкциям относятся выражения типа:  Проводка1.СубконтоДт1
//
// Параметры:
//  Формула  - Строка формулы
//  Проводки - ссылка на текущий набор записей регистра бухгалтерии
//
// Возвращаемое значение:
//  Строка - преобразованное формульное выражение
//
Функция ЗаменитьПараметры(Формула, Проводки)

	Для каждого Пров Из Проводки Цикл

		Ном = 1 + Проводки.Индекс(Пров);

		// Субконто Дт
		Если Не Пров.СчетДт.Пустая() Тогда

			ВидыСубконто =Пров.СчетДт.ВидыСубконто;
			Для Каждого Стр Из ВидыСубконто Цикл

				ИндСубк = ВидыСубконто.Индекс(Стр);
				Что     = "Проводка" + Ном + ".СубконтоДт" + (ИндСубк+1);
				НаЧто   = "Проводки[" + (Ном-1) + "].СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоТиповые.НайтиПоКоду(""" + Стр.ВидСубконто.Код + """)]";
				Формула = СтрЗаменить(Формула, Что, НаЧто);

			КонецЦикла;

		КонецЕсли;

		// Субконто Кт
		Если Не Пров.СчетКт.Пустая() Тогда

			ВидыСубконто =Пров.СчетКт.ВидыСубконто;

			Для Каждого Стр Из ВидыСубконто Цикл

				ИндСубк = ВидыСубконто.Индекс(Стр);
				Что     = "Проводка" + Ном + ".СубконтоКт" + (ИндСубк+1);
				НаЧто   = "Проводки[" + (Ном-1) + "].СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоТиповые.НайтиПоКоду(""" + Стр.ВидСубконто.Код + """)]";
				Формула = СтрЗаменить(Формула, Что, НаЧто);

			КонецЦикла;

		КонецЕсли;

		// остальные поля
		Что     = "Проводка" + Ном;
		НаЧто   = "Проводки[" + (Ном-1) + "]";
		Формула = СтрЗаменить(Формула, Что, НаЧто);

	КонецЦикла;

	Возврат(Формула);

КонецФункции // ЗаменитьПараметры()

// Разбирает строку на две части: до подстроки разделителя и после
//
// Параметры:
//  Стр            - разбираемая строка
//  Разделитель    - подстрока-разделитель
//  Режим          - 0 - разделитель в возвращаемые подстроки не включается
//                   1 - разделитель включается в левую подстроку
//                   2 - разделитель включается в правую подстроку
//
// Возвращаемое значение:
//  Правая часть строки - до символа-разделителя
// 
Функция ОтделитьРазделителем(Стр, Знач Разделитель, Режим=0)

	ПраваяЧасть      = "";
	ПозРазделителя   = Найти(Стр, Разделитель);
	ДлинаРазделителя = СтрДлина(Разделитель);

	Если ПозРазделителя > 0 Тогда
		ПраваяЧасть = Сред(Стр, ПозРазделителя + ?(Режим = 2, 0, ДлинаРазделителя));
		Стр         = СокрЛП(Лев(Стр, ПозРазделителя - ?(Режим = 1, -ДлинаРазделителя + 1, 1)));
	КонецЕсли;

	Возврат(ПраваяЧасть);

КонецФункции // ОтделитьРазделителем()

// Вычислет значение поля (реквизита) проводки в соответствии с настройкой
// шаблона проводки в типовой операции
//
// Параметры:
//  ИмяПоля      - Строка - имя поля. Например: Сумма
//  Проводки	 - ссылка на текущий набор записей регистра бухгалтерии
//  Проводка     - ссылка на текущую запись в наборе регистра бухгалтерии
//  ШаблонЗаписи - ссылка на строку табличной части "Типовой" типовой операции
//  Формулы      - Структура, содержащая формулы полей
//  Параметры	 - Структура, содержащая значения параметров типовой операции
//
// Возвращаемое значение:
//  Значение типа соответствующего типу поля (реквизита) проводки
//
Функция ЗначениеПоля(ИмяПоля, Проводки, Проводка, ШаблонЗаписи, Формулы, Параметры)

	Значение       = Неопределено;
	ПрограммныйКод = "";

	Если Формулы <> Неопределено Тогда

		Формула = СокрЛП(Формулы[СокрЛП(ИмяПоля)]);

		Если Формула <> "" Тогда

			Значение = "";
			Стр      = "";

			Для каждого Пар Из Параметры Цикл
				Стр = Стр + Пар.Ключ + " = Параметры." + Пар.Ключ + ";" + Символы.ПС;
			КонецЦикла;

			Стр = Стр + "Значение = " + ЗаменитьПараметры(Формула, Проводки) + ";";

			Попытка
				Выполнить(Стр);
			Исключение

				СтрокаМодуля    = ОтделитьРазделителем(ОписаниеОшибки(), "{");
				ОписаниеОшибки  = ОтделитьРазделителем(СтрокаМодуля, "}: ");
				Сообщить("Ошибка при вычислении значения поля по формуле: " + ИмяПоля + " - " + ОписаниеОшибки);

			КонецПопытки; 

			Возврат Значение;

		КонецЕсли;

	КонецЕсли;

	Значение = ШаблонЗаписи[ИмяПоля];

	Возврат Значение;

КонецФункции // ЗначениеПоля()


////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

// Заполняет документ на основании типовой операции
//
// Параметры:
//  ТО       - ссылка на элемент справочника Типовые операции. Типовая операция,
//             на основании которой заполняется документ
//  Очистить - Булево - если Истина, то перед заполнением удаляются
//             существующие проводки
//
// Возвращаемое значение:
//  Нет
//
Процедура ЗаполнитьНаОснованииТиповойОперации(ТО, Очистить = Истина) Экспорт

	Проводки    = Движения.Типовой;
	ПроводкиНУ  = Движения.Налоговый;

	Если Очистить = Истина Тогда
		Проводки.Очистить();
		ПроводкиНУ.Очистить();
	КонецЕсли;

	// Инициализация параметров

	Параметры = Новый Структура();

	// Не запрашиваемые параметры
	Для каждого Параметр Из ТО.Параметры Цикл

		Если Не Параметр.НеЗапрашивать Тогда
			Продолжить;
		КонецЕсли;

		Параметры.Вставить(Параметр.Имя, Параметр.Значение);

	КонецЦикла;

	// Запрашиваемые параметры
	Для каждого Параметр Из ЗапрашиваемыеПараметры Цикл
		Параметры.Вставить(Параметр.Имя, Параметр.Значение);
	КонецЦикла;

	// НачалоАлгоритма
	НачалоАлгоритма = "";
	Для каждого Параметр Из Параметры Цикл
		НачалоАлгоритма = НачалоАлгоритма + Параметр.Ключ + " = Параметры." + Параметр.Ключ + ";" + Символы.ПС;
	КонецЦикла;

	// КонецАлгоритма
	КонецАлгоритма = Символы.ПС;
	Для каждого Параметр Из Параметры Цикл
		КонецАлгоритма = КонецАлгоритма + "Параметры." + Параметр.Ключ + " = " + Параметр.Ключ + ";" + Символы.ПС;
	КонецЦикла;

	// АлгоритмПриВводе
	АлгоритмПриВводе = ТО.АлгоритмПриВводе;
	Если Не ПустаяСтрока(АлгоритмПриВводе) Тогда

		Попытка
			Выполнить(НачалоАлгоритма + АлгоритмПриВводе + КонецАлгоритма);
		Исключение

			СтрокаМодуля   = ОтделитьРазделителем(ОписаниеОшибки(), "{");
			ОписаниеОшибки = ОтделитьРазделителем(СтрокаМодуля, "}: ");
			Сообщить("Алгоритм типовой операции (перед формированием проводок):  " + ОписаниеОшибки);

		КонецПопытки;

	КонецЕсли;

	// Неудовлетворяющие условиям проводки будем добавлять в массив
	МассивУдаляемыхПроводок    = Новый Массив;
	МассивУдаляемыхПроводокНУ  = Новый Массив;

	// Заполняем проводки по шаблонам БУ
	Для каждого ШаблонЗаписи Из ТО.Типовой Цикл

		Проводка   = Проводки.Добавить();

		Формулы    = Неопределено;
		СтрФормулы = СокрЛП(ШаблонЗаписи.Формулы);

		Если СтрФормулы <> "" Тогда
			Формулы = ЗначениеИзСтрокиВнутр(СтрФормулы);
		КонецЕсли;

		СубконтоДт1     = "";
		СубконтоДт2     = "";
		СубконтоДт3     = "";

		КоличествоДт    = 0;
		ВалютаДт        = "";
		ВалютнаяСуммаДт = 0;

		СубконтоКт1     = "";
		СубконтоКт2     = "";
		СубконтоКт3     = "";

		КоличествоКт    = 0;
		ВалютаКт        = "";
		ВалютнаяСуммаКт = 0;

		Проводка.СчетДт = ЗначениеПоля("СчетДт", Проводки, Проводка, ШаблонЗаписи, Формулы, Параметры);
		СчетДт          = Проводка.СчетДт;

		Если Не Проводка.СчетДт.Пустая() Тогда

			ВидыСубконто = Проводка.СчетДт.ВидыСубконто;

			Для Каждого Стр Из ВидыСубконто Цикл

				ИмяПеременной = "СубконтоДт" + Строка(1+ВидыСубконто.Индекс(Стр));
				Зн            = ЗначениеПоля(ИмяПеременной, Проводки, Проводка, ШаблонЗаписи, Формулы, Параметры);
				Проводка.СубконтоДт[Стр.ВидСубконто] = Зн;

				Выполнить(ИмяПеременной + " = Зн;");

			КонецЦикла;

			Если Проводка.СчетДт.Количественный Тогда
				Проводка.КоличествоДт = ЗначениеПоля("КоличествоДт", Проводки, Проводка, ШаблонЗаписи, Формулы, Параметры);
				КоличествоДт          = Проводка.КоличествоДт;
			КонецЕсли;

			Если Проводка.СчетДт.Валютный Тогда

				Проводка.ВалютаДт        = ЗначениеПоля("ВалютаДт", Проводки, Проводка, ШаблонЗаписи, Формулы, Параметры);
				ВалютаДт                 = Проводка.ВалютаДт;
				Проводка.ВалютнаяСуммаДт = ЗначениеПоля("ВалютнаяСуммаДт", Проводки, Проводка, ШаблонЗаписи, Формулы, Параметры);
				ВалютнаяСуммаДт          = Проводка.ВалютнаяСуммаДт;

			КонецЕсли;

		КонецЕсли;

		Проводка.СчетКт = ЗначениеПоля("СчетКт", Проводки, Проводка, ШаблонЗаписи, Формулы, Параметры);
		СчетКт          = Проводка.СчетКт;

		Если Не Проводка.СчетКт.Пустая() Тогда

			ВидыСубконто = Проводка.СчетКт.ВидыСубконто;

			Для Каждого Стр Из ВидыСубконто Цикл

				ИмяПеременной = "СубконтоКт" + Строка(1+ВидыСубконто.Индекс(Стр));
				Зн            = ЗначениеПоля(ИмяПеременной, Проводки, Проводка, ШаблонЗаписи, Формулы, Параметры);
				Проводка.СубконтоКт[Стр.ВидСубконто] = Зн;

				Выполнить(ИмяПеременной + " = Зн;");

			КонецЦикла;

			Если Проводка.СчетКт.Количественный Тогда
				Проводка.КоличествоКт = ЗначениеПоля("КоличествоКт", Проводки, Проводка, ШаблонЗаписи, Формулы, Параметры);
				КоличествоКт          = Проводка.КоличествоКт;
			КонецЕсли;

			Если Проводка.СчетКт.Валютный Тогда

				Проводка.ВалютаКт        = ЗначениеПоля("ВалютаКт", Проводки, Проводка, ШаблонЗаписи, Формулы, Параметры);
				ВалютаКт                 = Проводка.ВалютаКт;
				Проводка.ВалютнаяСуммаКт = ЗначениеПоля("ВалютнаяСуммаКт", Проводки, Проводка, ШаблонЗаписи, Формулы, Параметры);
				ВалютнаяСуммаКт          = Проводка.ВалютнаяСуммаКт;

			КонецЕсли;

		КонецЕсли;

		Проводка.Сумма        = ЗначениеПоля("Сумма", Проводки, Проводка, ШаблонЗаписи, Формулы, Параметры);
		Сумма                 = Проводка.Сумма;

		Проводка.НомерЖурнала = ЗначениеПоля("НомерЖурнала", Проводки, Проводка, ШаблонЗаписи, Формулы, Параметры);
		НомерЖурнала          = Проводка.НомерЖурнала;

		Проводка.Содержание   = ЗначениеПоля("Содержание", Проводки, Проводка, ШаблонЗаписи, Формулы, Параметры);

		// Условие формирования проводки
		СтрокаУсловия = ШаблонЗаписи.Условие;

		Если Не ПустаяСтрока(СтрокаУсловия) Тогда

			УсловиеВыполняется = Ложь;
			АлгоритмУсловия    = НачалоАлгоритма + "УсловиеВыполняется = " + ЗаменитьПараметры(СтрокаУсловия, Проводки) + ";";

			Попытка

				Выполнить(АлгоритмУсловия);

				Если Не УсловиеВыполняется Тогда
					МассивУдаляемыхПроводок.Добавить(Проводка);
				КонецЕсли;

			Исключение

				СтрокаМодуля    = ОтделитьРазделителем(ОписаниеОшибки(), "{");
				ОписаниеОшибки  = ОтделитьРазделителем(СтрокаМодуля, "}: ");
				Сообщить("Условие формирования проводки №" + (1 + ТО.Типовой.Индекс(ШаблонЗаписи))  + " " + ОписаниеОшибки);

			КонецПопытки;

		КонецЕсли;

	КонецЦикла; // по шаблонам проводок

	// Заполняем проводки по шаблонам НУ
	Для каждого ШаблонЗаписи Из ТО.Налоговый Цикл

		Проводка   = ПроводкиНУ.Добавить();

		Формулы    = Неопределено;
		СтрФормулы = СокрЛП(ШаблонЗаписи.Формулы);

		Если СтрФормулы <> "" Тогда
			Формулы = ЗначениеИзСтрокиВнутр(СтрФормулы);
		КонецЕсли;

		СубконтоДт1     = "";
		СубконтоДт2     = "";
		СубконтоДт3     = "";

		КоличествоДт    = 0;

		СубконтоКт1     = "";
		СубконтоКт2     = "";
		СубконтоКт3     = "";

		КоличествоКт    = 0;

		Проводка.СчетДт = ЗначениеПоля("СчетДт", ПроводкиНУ, Проводка, ШаблонЗаписи, Формулы, Параметры);
		СчетДт          = Проводка.СчетДт;

		Если Не Проводка.СчетДт.Пустая() Тогда

			ВидыСубконто = Проводка.СчетДт.ВидыСубконто;

			Для Каждого Стр Из ВидыСубконто Цикл

				ИмяПеременной = "СубконтоДт" + Строка(1+ВидыСубконто.Индекс(Стр));
				Зн            = ЗначениеПоля(ИмяПеременной, ПроводкиНУ, Проводка, ШаблонЗаписи, Формулы, Параметры);
				Проводка.СубконтоДт[Стр.ВидСубконто] = Зн;

				Выполнить(ИмяПеременной + " = Зн;");

			КонецЦикла;

			Если Проводка.СчетДт.Количественный Тогда
				Проводка.КоличествоДт = ЗначениеПоля("КоличествоДт", ПроводкиНУ, Проводка, ШаблонЗаписи, Формулы, Параметры);
				КоличествоДт          = Проводка.КоличествоДт;
			КонецЕсли;

		КонецЕсли;

		Проводка.СчетКт = ЗначениеПоля("СчетКт", ПроводкиНУ, Проводка, ШаблонЗаписи, Формулы, Параметры);
		СчетКт          = Проводка.СчетКт;

		Если Не Проводка.СчетКт.Пустая() Тогда

			ВидыСубконто = Проводка.СчетКт.ВидыСубконто;

			Для Каждого Стр Из ВидыСубконто Цикл

				ИмяПеременной = "СубконтоКт" + Строка(1+ВидыСубконто.Индекс(Стр));
				Зн            = ЗначениеПоля(ИмяПеременной, ПроводкиНУ, Проводка, ШаблонЗаписи, Формулы, Параметры);
				Проводка.СубконтоКт[Стр.ВидСубконто] = Зн;

				Выполнить(ИмяПеременной + " = Зн;");

			КонецЦикла;

			Если Проводка.СчетКт.Количественный Тогда
				Проводка.КоличествоКт = ЗначениеПоля("КоличествоКт", ПроводкиНУ, Проводка, ШаблонЗаписи, Формулы, Параметры);
				КоличествоКт          = Проводка.КоличествоКт;
			КонецЕсли;

		КонецЕсли;

		Проводка.Сумма        = ЗначениеПоля("Сумма", ПроводкиНУ, Проводка, ШаблонЗаписи, Формулы, Параметры);
		Сумма                 = Проводка.Сумма;

		Проводка.НомерЖурнала = ЗначениеПоля("НомерЖурнала", ПроводкиНУ, Проводка, ШаблонЗаписи, Формулы, Параметры);
		НомерЖурнала          = Проводка.НомерЖурнала;

		Проводка.ВидУчетаДт   = ЗначениеПоля("ВидУчетаДт", ПроводкиНУ, Проводка, ШаблонЗаписи, Формулы, Параметры);
		ВидУчета              = Проводка.ВидУчетаДт;

		Проводка.ВидУчетаКт   = ЗначениеПоля("ВидУчетаКт", ПроводкиНУ, Проводка, ШаблонЗаписи, Формулы, Параметры);
		ВидУчета              = Проводка.ВидУчетаКт;

		Проводка.Содержание   = ЗначениеПоля("Содержание", ПроводкиНУ, Проводка, ШаблонЗаписи, Формулы, Параметры);

		// Условие формирования проводки
		СтрокаУсловия = ШаблонЗаписи.Условие;

		Если Не ПустаяСтрока(СтрокаУсловия) Тогда

			УсловиеВыполняется = Ложь;
			АлгоритмУсловия    = НачалоАлгоритма + "УсловиеВыполняется = " + ЗаменитьПараметры(СтрокаУсловия, ПроводкиНУ) + ";";

			Попытка

				Выполнить(АлгоритмУсловия);

				Если Не УсловиеВыполняется Тогда
					МассивУдаляемыхПроводокНУ.Добавить(Проводка);
				КонецЕсли;

			Исключение

				СтрокаМодуля    = ОтделитьРазделителем(ОписаниеОшибки(), "{");
				ОписаниеОшибки  = ОтделитьРазделителем(СтрокаМодуля, "}: ");
				Сообщить("Условие формирования проводки (НУ) №" + (1 + ТО.Налоговый.Индекс(ШаблонЗаписи))  + " " + ОписаниеОшибки);

			КонецПопытки;

		КонецЕсли;

	КонецЦикла; // по шаблонам проводок

	// Выполним алгоритм после формирования проводок
	АлгоритмОперации = СокрЛП(ТО.АлгоритмПослеВвода);
	Если Не ПустаяСтрока(АлгоритмОперации) Тогда

		Попытка
			Выполнить(НачалоАлгоритма + ЗаменитьПараметры(АлгоритмОперации, Проводки));
		Исключение
			СтрокаМодуля    = ОтделитьРазделителем(ОписаниеОшибки(), "{");
			ОписаниеОшибки  = ОтделитьРазделителем(СтрокаМодуля, "}: ");
			Сообщить("Алгоритм типовой операции (после формирования проводок):  " + ОписаниеОшибки);
		КонецПопытки; 

	КонецЕсли;

	// Вычислим содержание операции по формуле
	ФормулаСодержания = СокрЛП(ТО.ФормулаСодержания);
	Если ФормулаСодержания <> "" Тогда

		АлгоритмСодержания = НачалоАлгоритма + "Содержание = " + ЗаменитьПараметры(ФормулаСодержания, Проводки) + ";";

		Попытка
			Выполнить(АлгоритмСодержания);
		Исключение
			СтрокаМодуля    = ОтделитьРазделителем(ОписаниеОшибки(), "{");
			ОписаниеОшибки  = ОтделитьРазделителем(СтрокаМодуля, "}: ");
			Сообщить("Формула содержания операции:  " + ОписаниеОшибки);
		КонецПопытки;

	КонецЕсли;

	// Вычислим сумму операции по формуле
	ФормулаСуммыОперации = СокрЛП(ТО.ФормулаСуммыОперации);
	Если ФормулаСуммыОперации <> "" Тогда

		АлгоритмСуммыОперации = НачалоАлгоритма + "СуммаОперации = " + ЗаменитьПараметры(ФормулаСуммыОперации, Проводки) + ";";

		Попытка
			Выполнить(АлгоритмСуммыОперации);
		Исключение
			СтрокаМодуля    = ОтделитьРазделителем(ОписаниеОшибки(), "{");
			ОписаниеОшибки  = ОтделитьРазделителем(СтрокаМодуля, "}: ");
			Сообщить("Формула суммы операции:  " + ОписаниеОшибки);
		КонецПопытки;

	КонецЕсли;

	// Удалим неудовлетворяющие условиям проводки
	Для каждого Проводка Из МассивУдаляемыхПроводок Цикл
		Проводки.Удалить(Проводка);
	КонецЦикла;

	// Удалим неудовлетворяющие условиям проводки
	Для каждого Проводка Из МассивУдаляемыхПроводокНУ Цикл
		ПроводкиНУ.Удалить(Проводка);
	КонецЦикла;    	

КонецПроцедуры // ЗаполнитьНаОснованииТиповойОперации()


#Если Клиент Тогда

// Функция формирует табличный документ с печатной формой бухгалтерской справки.
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  Табличный документ - печатная форма бухгалтерской справки.
//
Функция ПечатьБухгалтерскойСправки()
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб				= Истина;
	ТабДокумент.ПолеСверху				= 10;
	ТабДокумент.ПолеСлева				= 0;
	ТабДокумент.ПолеСнизу				= 0;
	ТабДокумент.ПолеСправа				= 0;
	ТабДокумент.РазмерКолонтитулаСверху	= 10;
	ТабДокумент.ОриентацияСтраницы		= ОриентацияСтраницы.Ландшафт;
	ТабДокумент.ИмяПараметровПечати		= "ПАРАМЕТРЫ_ПЕЧАТИ_ОперацияБух_БухгалтерскаяСправка";
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОперацияБух.Ссылка КАК Ссылка,
	               |	ОперацияБух.Номер,
	               |	ОперацияБух.Ответственный,
	               |	ОперацияБух.Дата,
	               |	ОперацияБух.Содержание КАК СодержаниеОперации
	               |ИЗ
	               |	Документ.ОперацияБух КАК ОперацияБух
	               |ГДЕ
	               |	ОперацияБух.Ссылка = &Регистратор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТиповойДвиженияССубконто.НомерСтроки КАК НомерСтроки,
	               |	ТиповойДвиженияССубконто.СчетДт,
	               |	ТиповойДвиженияССубконто.СтруктурноеПодразделениеДт,
	               |	ТиповойДвиженияССубконто.СубконтоДт1,
	               |	ТиповойДвиженияССубконто.СубконтоДт2,
	               |	ТиповойДвиженияССубконто.СубконтоДт3,
	               |	ТиповойДвиженияССубконто.СчетКт,
	               |	ТиповойДвиженияССубконто.СтруктурноеПодразделениеКт,
	               |	ТиповойДвиженияССубконто.СубконтоКт1,
	               |	ТиповойДвиженияССубконто.СубконтоКт2,
	               |	ТиповойДвиженияССубконто.СубконтоКт3,
	               |	ТиповойДвиженияССубконто.Организация,
	               |	ТиповойДвиженияССубконто.ВалютаДт,
	               |	ТиповойДвиженияССубконто.ВалютаКт,
	               |	ТиповойДвиженияССубконто.Сумма,
	               |	ТиповойДвиженияССубконто.КоличествоДт,
	               |	ТиповойДвиженияССубконто.КоличествоКт,
	               |	ТиповойДвиженияССубконто.Содержание,
	               |	ТиповойДвиженияССубконто.Регистратор,
	               |	ВЫБОР
	               |		КОГДА ТиповойДвиженияССубконто.СубконтоДт1 ССЫЛКА Справочник.Номенклатура
	               |			ТОГДА ТиповойДвиженияССубконто.СубконтоДт1.БазоваяЕдиницаИзмерения
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ТиповойДвиженияССубконто.СубконтоДт2 ССЫЛКА Справочник.Номенклатура
	               |					ТОГДА ТиповойДвиженияССубконто.СубконтоДт2.БазоваяЕдиницаИзмерения
	               |				ИНАЧЕ ВЫБОР
	               |						КОГДА ТиповойДвиженияССубконто.СубконтоДт3 ССЫЛКА Справочник.Номенклатура
	               |							ТОГДА ТиповойДвиженияССубконто.СубконтоДт3.БазоваяЕдиницаИзмерения
	               |						ИНАЧЕ """"
	               |					КОНЕЦ
	               |			КОНЕЦ
	               |	КОНЕЦ КАК БазоваяЕдиницаИзмеренияДт,
	               |	ВЫБОР
	               |		КОГДА ТиповойДвиженияССубконто.СубконтоКт1 ССЫЛКА Справочник.Номенклатура
	               |			ТОГДА ТиповойДвиженияССубконто.СубконтоКт1.БазоваяЕдиницаИзмерения
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ТиповойДвиженияССубконто.СубконтоКт2 ССЫЛКА Справочник.Номенклатура
	               |					ТОГДА ТиповойДвиженияССубконто.СубконтоКт2.БазоваяЕдиницаИзмерения
	               |				ИНАЧЕ ВЫБОР
	               |						КОГДА ТиповойДвиженияССубконто.СубконтоКт3 ССЫЛКА Справочник.Номенклатура
	               |							ТОГДА ТиповойДвиженияССубконто.СубконтоКт3.БазоваяЕдиницаИзмерения
	               |						ИНАЧЕ """"
	               |					КОНЕЦ
	               |			КОНЕЦ
	               |	КОНЕЦ КАК БазоваяЕдиницаИзмеренияКт
	               |ИЗ
	               |	РегистрБухгалтерии.Типовой.ДвиженияССубконто(
	               |			,
	               |			,
	               |			Активность
	               |				И Регистратор = &Регистратор,
	               |			,
	               |			) КАК ТиповойДвиженияССубконто
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерСтроки";
	
	Выборка = Запрос.ВыполнитьПакет();
	ВыборкаШапка = Выборка[0].Выбрать();
	
	Если ВыборкаШапка.Следующий() Тогда
		
		Если ТабДокумент.ВысотаТаблицы > 0 Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		// Зададим параметры макета по умолчанию
		ТабДокумент.РазмерКолонтитулаСверху = 0;
		ТабДокумент.РазмерКолонтитулаСнизу  = 0;
		ТабДокумент.АвтоМасштаб             = Истина;
		ТабДокумент.ОриентацияСтраницы      = ОриентацияСтраницы.Ландшафт;
		
		Макет = ПолучитьОбщийМакет("С1");
		// Получаем области макета для вывода в табличный документ.
		ШапкаДокумента   = Макет.ПолучитьОбласть("Шапка");
		ЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
		СтрокаТаблицы    = Макет.ПолучитьОбласть("СтрокаТаблицы");
		ПодвалДокумента  = Макет.ПолучитьОбласть("Подвал");
		
		// Выведем шапку документа.
		СтруктурнаяЕдиницаОрганизация = ОбщегоНазначения.ПолучитьСтруктурнуюЕдиницу(Организация, СтруктурноеПодразделение);
		СведенияОбОрганизации 		  = ОбщегоНазначения.СведенияОЮрФизЛице(СтруктурнаяЕдиницаОрганизация, ВыборкаШапка.Дата);
		
		ШапкаДокумента.Параметры.ПредставлениеОрганизации	= ОбщегоНазначения.ОписаниеОрганизации(СведенияОбОрганизации, "ПолноеНаименование,");
		ШапкаДокумента.Параметры.НомерДокумента				= ОбщегоНазначения.ПолучитьНомерНаПечать(ЭтотОбъект.Ссылка, глСписокПрефиксовУзлов);
		ШапкаДокумента.Параметры.ДатаСоставления			= Формат(ВыборкаШапка.Дата, "ДЛФ=D");
		
		ШапкаДокумента.Параметры.ОрганизацияРНН_БИН = ОбщегоНазначения.ОписаниеОрганизации(СведенияОбОрганизации, "БИН_ИИН,", Ложь, ВыборкаШапка.Дата, "ru");
		ШапкаДокумента.Параметры.СодержаниеОперации = ВыборкаШапка.СодержаниеОперации;
		ТабДокумент.Вывести(ШапкаДокумента);
		
		// Выведем заголовок таблицы.
		ТабДокумент.Вывести(ЗаголовокТаблицы);
		
		СуммаПоДокументу  = 0;
		КоличествоСтрокВОперации = 0;
		
		ВыборкаДвижений = Выборка[1].Выбрать();
		
		// Выведем строки документа.
		Пока ВыборкаДвижений.Следующий() Цикл		
			
			СтрокаТаблицы.Параметры.Заполнить(ВыборкаДвижений);
			
			АналитикаДт = Строка(ВыборкаДвижений.СубконтоДт1) + Символы.ПС
			+ Строка(ВыборкаДвижений.СубконтоДт2) + Символы.ПС
			+ Строка(ВыборкаДвижений.СубконтоДт3);
			
			АналитикаКт = Строка(ВыборкаДвижений.СубконтоКт1) + Символы.ПС
			+ Строка(ВыборкаДвижений.СубконтоКт2) + Символы.ПС
			+ Строка(ВыборкаДвижений.СубконтоКт3);
			
			СтрокаТаблицы.Параметры.АналитикаДт = АналитикаДт;
			СтрокаТаблицы.Параметры.АналитикаКт = АналитикаКт;
			
			СуммаПоДокументу = СуммаПоДокументу + ВыборкаДвижений.Сумма;
			
			КоличествоСтрокВОперации = ?(ЗначениеЗаполнено(ВыборкаДвижений.НомерСтроки),КоличествоСтрокВОперации + 1,КоличествоСтрокВОперации);			
			      			
			Если НЕ УниверсальныеМеханизмы.ПроверитьВыводДляТабличногоДокумента(ТабДокумент, СтрокаТаблицы) Тогда
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ТабДокумент.Вывести(ЗаголовокТаблицы);
			КонецЕсли;	
			
			ТабДокумент.Вывести(СтрокаТаблицы);
			
		КонецЦикла; 		
		
		Руководители = ОбщегоНазначения.ОтветственныеЛицаОрганизаций(СтруктурнаяЕдиницаОрганизация,ВыборкаШапка.Дата);
		
		ПодвалДокумента.Параметры.РасшифровкаПодписиРуководитель	= Руководители.Руководитель;
		ПодвалДокумента.Параметры.РасшифровкаПодписиГлавБух			= Руководители.ГлавныйБухгалтер;
		
		ПодвалДокумента.Параметры.ВсегоКорреспонденцийПрописью = ?(КоличествоСтрокВОперации <> 0, ОбщегоНазначения.КоличествоПрописью(КоличествоСтрокВОперации), "");
				
		ПодвалДокумента.Параметры.СуммаПрописью = ?(СуммаПоДокументу <> 0,ОбщегоНазначения.СформироватьСуммуПрописью(СуммаПоДокументу, мВалютаРегламентированногоУчета), "");		
		
		// Выведем подвал
		Если НЕ УниверсальныеМеханизмы.ПроверитьВыводДляТабличногоДокумента(ТабДокумент, ПодвалДокумента) Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ТабДокумент.Вывести(ПодвалДокумента);
		
	КонецЕсли;
	
	Возврат ТабДокумент;
	
КонецФункции // ПечатьБухгалтерскойСправки()
	
// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт

	// Получить экземпляр документа на печать
	Если ИмяМакета = "С1" Тогда

		ТабДокумент = ПечатьБухгалтерскойСправки();
		
	КонецЕсли;

	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, РаботаСДиалогами.СформироватьЗаголовокДокумента(ЭтотОбъект), Ссылка);

КонецПроцедуры // Печать

#КонецЕсли


// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура("С1", "С-1 (Бухгалтерская справка)");

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПриКопировании(ОбъектКопирования)

	Если ОбъектКопирования = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ТипЗнч(ОбъектКопирования) <> Тип("ДокументОбъект.ОперацияБух") Тогда
		Возврат;
	КонецЕсли;

	Организация   = ОбъектКопирования.Организация;
	Комментарий   = ОбъектКопирования.Комментарий;
	Содержание    = ОбъектКопирования.Содержание;
	Ответственный = ОбъектКопирования.Ответственный;

	ДвиженияБУ = РегистрыБухгалтерии.Типовой.ВыбратьПоРегистратору(ОбъектКопирования.Ссылка);

	Пока ДвиженияБУ.Следующий() Цикл

		Проводка = Движения.Типовой.Добавить();

		Проводка.СчетДт          = ДвиженияБУ.СчетДт;
		Проводка.СчетКт          = ДвиженияБУ.СчетКт;

		Для каждого Субконто Из ДвиженияБУ.СубконтоДт Цикл
			Проводка.СубконтоДт[Субконто.Ключ] = Субконто.Значение;
		КонецЦикла;

		Для каждого Субконто Из ДвиженияБУ.СубконтоКт Цикл
			Проводка.СубконтоКт[Субконто.Ключ] = Субконто.Значение;
		КонецЦикла;

		Проводка.ВалютаДт        			= ДвиженияБУ.ВалютаДт;
		Проводка.ВалютаКт        			= ДвиженияБУ.ВалютаКт;
		Проводка.ВалютнаяСуммаДт 			= ДвиженияБУ.ВалютнаяСуммаДт;
		Проводка.ВалютнаяСуммаКт 			= ДвиженияБУ.ВалютнаяСуммаКт;
		Проводка.КоличествоДт 			    = ДвиженияБУ.КоличествоДт;
		Проводка.КоличествоКт    			= ДвиженияБУ.КоличествоКт;
		Проводка.НомерЖурнала    			= ДвиженияБУ.НомерЖурнала;
		Проводка.Организация     			= ДвиженияБУ.Организация;
		Проводка.СтруктурноеПодразделениеДт	= ДвиженияБУ.СтруктурноеПодразделениеДт;
		Проводка.СтруктурноеПодразделениеКт = ДвиженияБУ.СтруктурноеПодразделениеКт;
		Проводка.Содержание      			= ДвиженияБУ.Содержание;
		Проводка.Сумма           			= ДвиженияБУ.Сумма;

	КонецЦикла;

	ДвиженияНУ = РегистрыБухгалтерии.Налоговый.ВыбратьПоРегистратору(ОбъектКопирования.Ссылка);

	Пока ДвиженияНУ.Следующий() Цикл

		Проводка = Движения.Налоговый.Добавить();

		Проводка.СчетДт          = ДвиженияНУ.СчетДт;
		Проводка.СчетКт          = ДвиженияНУ.СчетКт;

		Для каждого Субконто Из ДвиженияНУ.СубконтоДт Цикл
			Проводка.СубконтоДт[Субконто.Ключ] = Субконто.Значение;
		КонецЦикла;

		Для каждого Субконто Из ДвиженияНУ.СубконтоКт Цикл
			Проводка.СубконтоКт[Субконто.Ключ] = Субконто.Значение;
		КонецЦикла;

		Проводка.КоличествоДт    			= ДвиженияНУ.КоличествоДт;
		Проводка.КоличествоКт    			= ДвиженияНУ.КоличествоКт;
		Проводка.НомерЖурнала    			= ДвиженияНУ.НомерЖурнала;
		Проводка.Организация     			= ДвиженияНУ.Организация;
		Проводка.СтруктурноеПодразделениеДт	= ДвиженияНУ.СтруктурноеПодразделениеДт;
		Проводка.СтруктурноеПодразделениеКт = ДвиженияНУ.СтруктурноеПодразделениеКт;
		Проводка.ВидУчетаДт      			= ДвиженияНУ.ВидУчетаДт;
		Проводка.ВидУчетаКт      			= ДвиженияНУ.ВидУчетаКт;
		Проводка.Содержание      			= ДвиженияНУ.Содержание;
		Проводка.Сумма           			= ДвиженияНУ.Сумма;

	КонецЦикла;
	
КонецПроцедуры // ПриКопировании()

Процедура ОбработкаЗаполнения(Основание)

	Если НЕ (ТипЗнч(Основание) = Тип("СправочникСсылка.ТиповыеОперации")) Тогда
		Возврат;
	КонецЕсли;

	#Если Клиент Тогда

		СписокТиповыхОпераций = ВосстановитьЗначение("СписокТиповыхОпераций");

		Если СписокТиповыхОпераций = Неопределено Тогда
			СписокТиповыхОпераций = Новый СписокЗначений; 
		Иначе

			Элемент = СписокТиповыхОпераций.НайтиПоЗначению(Основание);
			Если Элемент <> Неопределено Тогда
				СписокТиповыхОпераций.Удалить(Элемент);
			КонецЕсли;

		КонецЕсли;

		СписокТиповыхОпераций.Вставить(0, Основание, Строка(Основание));
		СохранитьЗначение("СписокТиповыхОпераций", СписокТиповыхОпераций);

	#КонецЕсли

	// Инициализация параметров
	Параметры = Новый Структура();
	Для каждого Пар Из Основание.Параметры Цикл
		Параметры.Вставить(Пар.Имя, Пар.Значение);
	КонецЦикла;

	// АлгоритмПередВводом
	АлгоритмПередВводом = Основание.АлгоритмПередВводом;
	Если Не ПустаяСтрока(АлгоритмПередВводом) Тогда

		// НачалоАлгоритма
		НачалоАлгоритма = "";
		Для каждого Пар Из Параметры Цикл
			НачалоАлгоритма = НачалоАлгоритма + Пар.Ключ + " = Параметры." + Пар.Ключ + ";" + Символы.ПС;
		КонецЦикла;

		// КонецАлгоритма
		КонецАлгоритма = Символы.ПС;
		Для каждого Пар Из Параметры Цикл
			КонецАлгоритма = КонецАлгоритма + "Параметры." + Пар.Ключ + " = " + Пар.Ключ + ";" + Символы.ПС;
		КонецЦикла;

		Попытка

			Выполнить(НачалоАлгоритма + АлгоритмПередВводом + КонецАлгоритма);

		Исключение

			СтрокаМодуля    = ОтделитьРазделителем(ОписаниеОшибки(), "{");
			ОписаниеОшибки  = ОтделитьРазделителем(СтрокаМодуля, "}: ");
			Сообщить("Алгоритм типовой операции (перед заполнением параметров):  " + ОписаниеОшибки);

		КонецПопытки;

	КонецЕсли;

	ЗапрашиваемыеПараметры.Очистить();
	ТиповаяОперация = Основание.Ссылка;
	Для каждого Пар Из Основание.Параметры Цикл

		Если Пар.НеЗапрашивать Тогда
			Продолжить
		КонецЕсли;

		ОписаниеТиповПараметра = Пар.Тип.Получить();

		СтрокаТЧ               = ЗапрашиваемыеПараметры.Добавить();

		СтрокаТЧ.Имя           = Пар.Имя;
		СтрокаТЧ.Представление = Пар.Представление;
		СтрокаТЧ.Значение      = ОписаниеТиповПараметра.ПривестиЗначение(Параметры[Пар.Имя]);

	КонецЦикла;

	Если ЗапрашиваемыеПараметры.Количество() = 0 Тогда

		ЗаполнитьНаОснованииТиповойОперации(Основание);

	КонецЕсли;

КонецПроцедуры // ОбработкаЗаполнения()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ЭтоНовыйДокумент = Ссылка.Пустая();

	Если ЭтоНовыйДокумент Тогда
		РанееУстановленнаяПометкаУдаления = Ложь;

	Иначе

		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("СсылкаНаОперацию", Ссылка); 
		Запрос.Текст ="
		|ВЫБРАТЬ 
		|	0 
		|ИЗ
		|	Документ.ОперацияБух КАК Операция
		|
		|ГДЕ
		|	(Операция.Ссылка = &СсылкаНаОперацию) И
		|	(Операция.ПометкаУдаления = Ложь)";
		Результат = Запрос.Выполнить();

		РанееУстановленнаяПометкаУдаления = Результат.Пустой();

	КонецЕсли;

	Если ПометкаУдаления <> РанееУстановленнаяПометкаУдаления Тогда

		Для каждого ПроводкиДокумента из Движения Цикл

			Если (НЕ ПроводкиДокумента.Модифицированность()) И (НЕ ПроводкиДокумента.Выбран()) И
			     (НЕ ЭтоНовыйДокумент) Тогда

				ПроводкиДокумента.Прочитать();

			КонецЕсли;

			КоличествоПроводок = ПроводкиДокумента.Количество();

			Если КоличествоПроводок > 0 Тогда

				// Определяем текущую активность проводок по первой проводке
				ТекущаяАктивностьПроводок = ПроводкиДокумента[0].Активность;
				НужнаяАктивностьПроводок  = НЕ ПометкаУдаления;

				Если ТекущаяАктивностьПроводок <> НужнаяАктивностьПроводок Тогда
					ПроводкиДокумента.УстановитьАктивность(НужнаяАктивностьПроводок);
				КонецЕсли;

			КонецЕсли;

		КонецЦикла;

	КонецЕсли;

КонецПроцедуры // ПередЗаписью()

мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
мОтображатьСтруктурныеПодразделения = ОбщегоНазначения.ПолучитьПризнакОтображенияСтруктурныхПодразделений();
